<html>
<head>
	<meta http-equiv="Content-Type" content="text/html; charset=utf-8">
    <link href="../../help.css" type="text/css" rel="stylesheet">
</head>
<body>
<img src="../logo-editor.png" alt="TEST IMAGE fail!" style="display:block; margin:10px" />
<h1>Tipo de perfil</h1>
<p>Debido a que se permite exportar en distintos est&aacute;ndares de e-learning, existen distintos perfiles de evaluaci&oacute;n y adaptaci&oacute;n. La elecci&oacute;n de perfil est&aacute; relacionada con el modelo de datos que se va a atacar en el LMS, haciendo las pertinentes restricciones sobre el mismo. A d&iacute;a de hoy, podemos encontrar tres tipos:</p>
<ol>
    <li><b>Perfil normal</b> </p>
    <p>En este tipo de perfil no encuentra limitaci&oacute;n ninguna sobre el modelo de datos del LMS y se utiliza para aquellos est&aacute;ndares que no poseen modelo de datos espec&iacute;fico (como Learning Design).</p></li><li><b>Perfil Scorm 1.2</b></p>
    <p class="mejorar"><!-- Introducir alguna referencia a la web sobre SCORM-->Limita el modelo de datos para el est&aacute;ndar SCORM 1.2. Cuando se decidan modificar o consultar propiedades del LMS con motivo de que se haya cumplido una regla de evaluaci&oacute;n o adaptaci&oacute;n, solo nos permitir&aacute; elegir entre las partes del modelo de datos SCORM 1.2 que son de escritura o lectura, seg&uacute;n el perfil. De esta manera se impide almacenar o consultar valores en  partes del modelo de datos que son s&oacute;lo de lectura o s&oacute;lo de escritura, a la vez que 
    abstrae el conocimiento exacto de dicho modelo de datos. Si deseamos exportar como Scorm 1.2, y tenemos perfiles de evaluaci&oacute;n y/o adaptaci&oacute;n asignados a cualquiera de los cap&iacute;tulos, ser&aacute; requerido que dichos perfiles sean de este tipo.</p></li><li><b>Perfil Scorm 2004</b></p>
    <p>Act&uacute;a de manera id&eacute;ntica que para el est&aacute;ndar SCORM 1.2, pero para el modelo de datos del est&aacute;ndar SCORM 2004. Si deseamos exportar como Scorm 2004 o como AGREGA (los juegos exportados a AGREGA utilizan SCORM 2004), y tenemos perfiles de evaluaci&oacute;n y/o adaptaci&oacute;n asignados a cualquiera de los cap&iacute;tulos, ser&aacute; requerido que dichos perfiles sean de este tipo.</p></li>
</ol>
</body>
</html>