<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=utf-8">
<link href="../../help.css" type="text/css" rel="stylesheet">
</head>
<body>
<img src="../logo-editor.png" alt="TEST IMAGE fail!"
	style="display: block; margin: 10px" />
<h1>Escena: Apariencia</h1>
<p>En este panel se configura la apariencia de la escena, en
particular de su fondo.</p>
<h2>Imagen del fondo de la escena</h2>
<p><b>Obligatoria</b></p>
<p>Esta es la imagen que se ve en el fondo de la escena. La imagen
debe de tener un tama&ntilde;o m&iacute;nimo de 800x600 y se recomienda
que la altura no supere dicha los 600.</p>
<h2>M&aacute;scara frontal de la escena</h2>
<p><b>Opcional</b></p>
<p>Consiste en una imagen en blanco y negro que nos indica
qu&eacute; parte de la imagen del fondo debe dibujarse detr&aacute;s de
objetos, personajes y jugador y cu&aacute;l debe pintarse delante. A
continuaci&oacute;n se muestra una imagen de fondo y cual ser&iacute;a
su m&aacute;scara frontal: <img src="Scene_Appearence_files/mask.jpg"
	alt="Ejemplo de uso de m&aacute;scara frontal"
	style="display: block; margin: 10px" /> Como puede apreciarse, la
imagen corresponde a una clase. Lo l&oacute;gico es que tal como
est&aacute; tomada la imagen, los personajes se sit&uacute;en justo
delante de la pizarra pero detr&aacute;s de los pupitres. Por tanto la
m&aacute;scara ser&aacute; una imagen en la que los pupitres (primer
plano) est&aacute;n en negro y lo dem&aacute;s en blanco.</p>
<p>Las m&aacute;scaras frontales en &lt;e-Adventure&gt; comienzan a
estar en desuso por la complejidad de uso y limitaciones que presentan.
Como m&aacute;s adelante se describe, este comportamiento puede
conseguirse (y de forma mucho m&aacute;s refinada) combinando <i>capas</i>
y <i>objetos de atrezo</i>.</p>
<h2>M&uacute;sica de fondo</h2>
<p><b>Opcional</b></p>
<p>M&uacute;sica de fondo de la escena, que sonar&aacute;
c&iacute;clicamente mientras la escena est&eacute; en pantalla. Pistas
de audio en formato MP3 o MIDI son aceptadas.</p>
<h3>Ver tambi&eacute;n</h3>
<p><a href="../general/Appearence.html">Explicaci&oacute;n
general del uso de apariencias.</a></p>
</body>
</html>
