<html>

<head>
<title>Efecto reproducir animaci&oacute;n</title>
<style>

</style>

</head>

<body lang=ES>


<div class=Section1>

<p class=MsoNormal align=center style='text-align:center'><b><h1><center><span lang=ES-TRAD>Efecto Reproducir Animaci&oacute;n</span><center></h1></b></p>


<p><span lang=ES-TRAD>Este efecto reproduce la animaci&oacute;n elegida.
</span></p>

<p class=MsoNormal><span lang=ES-TRAD>Crear un efecto reproducir animaci&oacute;n:</span></p>

<UL type=disk>

<LI><p class=MsoNormal ><span lang=ES-TRAD ><b>Selecionar el efecto: </b>seleccionar el efecto en el panel de creaci&oacute;n de efectos.
Pulsar el bot&oacute;n OK.</span></p><br>

<LI><p class=MsoNormal ><span lang=ES-TRAD ><b>Panel de creaci&oacute;n del efecto: </b>a continuaci&oacute;n nos aparecer&aacute; el siguiente panel:<br><br>
En primer lugar se encuentra el bot&oacute;n de selecci&oacute;n de la animaci&oacute;n. Una vez lo pulsamos, adem&aacute;s de la posibilidad de navegar por los
directorios (!!!!!!quizas vinculo a esto???????) se previsualiza en la misma ventana. Una vez selecionado el archivo se activar&aacute; el bot&oacute;n "Ver", 
mediante el cual tambi&eacute;n se puede previsualizar la animaci&oacute;n, en este caso se mostrar&aacute; en una ventana distinta.<br><br>
En caso de querer eliminar la seleci&oacute;n del archivo elegido, se puede elegir otro, o pulsar el aspa roja que se encuentra a continuaci&oacute;n de
la ruta del fichero.<br><br>
Tambi&eacute;n encontramos un panel desplegable (inmediatamente debajo de los elementos comentados). En el podemos elegir una escena, la cual
se previsualizar&aacute; en la ventana actual. Ahora podemos elegir el punto de la pantalla en el que se reproducir&aacute; la animaci&oacute;n elegida, bien rellenando
las coordenadas X e Y, o bien pulsando con el rat&oacute;n en un punto. Cabe destacar que la elecci&oacute;n de una escena en la edici&oacute;n de este efecto es meramente
ilustrativa y no significa ni que el efecto se vaya a ejecutar necesariamente en esa escena. El efecto se ejecutar&aacute; cuando se realice la acci&oacute;n
que lo desencadena, y se ejecutar&aacute; en la escena en la que se encuentre el personaje en ese momento. 
</UL>

<p class=MsoNormal><span lang=ES-TRAD >&nbsp;</span></p>

</div>

</body>

</html>