<html>
<head></head>
<body>

<img src="../logo-editor.png" alt="e-Adventure logo"/>

<h1>Panel de condiciones</h1>

En el panel de condiciones se encontrara una primera parte que detalla las condiciones que se estan
editando. Luego hay una parte m&aacute;s grande donde se pueden editar las condiciones en si y por &uacute;ltimo
hay un boton para a&ntilde;adir nuevas condiciones y aceptar los cambios.<br>
<img src="./Conditions_Panel_files/conditionsPanel1.png"/><br>

<h2>Parte superior: descripci&oacute;n de la condici&oacute;n</h2>

En esta parte del panel nos encontrarmos con una breve descripci&oacute;n de a que
corresponde la condici&oacute;n que estamos editando.<br>

<h2>Parte inferior: a&ntilde;adir condiciones y aceptar cambios</h2>

En la parte inferior nos encontramos dos botones, por medio de los cuales podemos
a&ntilde;adir una nueva condici&oacute;n o aceptar los cambios hechos a las condiciones que estamos
editando y cerrar la ventana.<br>

<h2>El panel de edici&oacute;n</h2>

En este panel encontramos una descripci&oacute;n muy gr&aacute;fica de la condici&oacute;n que
estamos implementando.<br>
Cuando ponemos el rat&oacute;n sobre una condici&oacute;n, tenemos la posiblidad de:<br>
<i>Eliminar</i>: Con este bot&oacute;n quitamos la condici&oacute;n.<br>
<i>Duplicar</i>: Con este bot&oacute;n creamos una nueva condici&oacute;n exactamente igual a la
actual y justo a continuaci&oacute;n de esta unida por un "o bien".<br>
<i>Editar</i>: Este bot&oacute;n nos permite editar el contenido de la condici&oacute;n. Podemos camibar
tanto el elemento evaluado (de un flag a otro o de un flag a una variable, etc.) o
el valor con el que se compara.<br>
<br>
Cuando ponemos el rat&oacute;n sobre un "nexo", tambi&eacute;n podemos editar su valor que puede
cambiar entre <i>"Y adem&aacute;s"</i> y <i>"O bien"</i>. Las condiciones se agruparan
autom&aacute;ticamente de acuerdo al significado que tienen en el lenguaje de e-Adventure.<br>

<h3>Otras cosas...</h3>

Cuando a&ntilde;adimos una condici&oacute;n, esta se a&ntilde;ade despu&eacute;s de todas las condiciones ya
existentes. Si queremos a&ntilde;adir una condici&oacute;n en medio, el mejor procedimiento es
elegir la condici&oacute;n anterior al sitio donde queremos que vaya la nueva, duplicarla
y luego modificar el valor de la nueva condici&oacute;n creada.<br>
 
<h3>Ver tambien</h3>

<a href="./Conditions.html">Explicaci&oacute;n general de las condiciones</a><br>

</body>

</html>
