<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=utf-8">
<link href="../../help.css" type="text/css" rel="stylesheet">
</head>
<body>
<img src="../logo-editor.png" alt="e-Adventure logo" />
<h1>Panel de condiciones</h1>
<p>En el panel de condiciones se encontrar&aacute; una primera parte que
detalla las condiciones que se est&aacute;n editando. Luego hay una parte
m&aacute;s grande donde se pueden editar las condiciones en s&iacute;; Y por
&uacute;ltimo, hay un bot&oacute;n para a&ntilde;adir nuevas condiciones y
aceptar los cambios. <img
	src="./Conditions_Panel_files/conditionsPanel1.png"
	style="display: block; margin: 10px;" /></p>
<h2>Parte superior: descripci&oacute;n de la condici&oacute;n</h2>
<p>En esta parte del panel nos encontrarmos con una breve
descripci&oacute;n de a que corresponde la condici&oacute;n que estamos
editando.</p>
<h2>Parte inferior: a&ntilde;adir condiciones y aceptar cambios</h2>
<p>En la parte inferior nos encontramos dos botones, por medio de
los cuales podemos a&ntilde;adir una nueva condici&oacute;n o aceptar
los cambios hechos a las condiciones que estamos editando y cerrar la
ventana.</p>
<h2>El panel de edici&oacute;n</h2>
<p>En este panel encontramos una descripci&oacute;n muy
gr&aacute;fica de la condici&oacute;n que estamos implementando. Cuando
ponemos el rat&oacute;n sobre una condici&oacute;n, tenemos la
posiblidad de:</p>
<ul>
	<li><i> Eliminar</i>: Con este bot&oacute;n quitamos la
	condici&oacute;n.</li>
	<li><i>Duplicar</i>: Con este bot&oacute;n creamos una nueva
	condici&oacute;n exactamente igual a la actual y justo a
	continuaci&oacute;n de esta unida por un "o bien".</li>
	<li><i>Editar</i>: Este bot&oacute;n nos permite editar el
	contenido de la condici&oacute;n. Podemos camibar tanto el elemento
	evaluado (de un flag a otro o de un flag a una variable, etc.) o el
	valor con el que se compara.</li>
	<li>Cuando ponemos el rat&oacute;n sobre un "nexo", tambi&eacute;n
	podemos editar su valor que puede cambiar entre <i>"Y
	adem&aacute;s"</i> y <i>"O bien"</i>. Las condiciones se agruparan
	autom&aacute;ticamente de acuerdo al significado que tienen en el
	lenguaje de e-Adventure.</li>
</ul>
<h3>Otras cosas...</h3>
<p>Cuando a&ntilde;adimos una condici&oacute;n, &eacute;sta se a&ntilde;ade
despu&eacute;s de todas las condiciones ya existentes. Si queremos
a&ntilde;adir una condici&oacute;n en medio, el mejor procedimiento es
elegir la condici&oacute;n anterior al sitio donde queremos que vaya la
nueva, duplicarla y luego modificar el valor de la nueva
condici&oacute;n creada.</p>
<h3>Ver tambi&eacute;n</h3>
<p><a href="./Conditions.html">Explicaci&oacute;n general de las
condiciones</a></p>
</body>
</html>
