<html>

<head>
<title>Efecto mostrar texto</title>
<style>

</style>

</head>

<body lang=ES>

<img src="../logo-editor.png" alt="TEST IMAGE fail!"/>

<div class=Section1>

<p class=MsoNormal align=center style='text-align:center'><b><center><h1><span lang=ES-TRAD>Efecto Mostrar Texto</span></h1></center></b></p>

<p class=MsoNormal align=center style='text-align:center'><span lang=ES-TRAD>&nbsp;</span></p>

<p><span lang=ES-TRAD>Mediante este efecto se muestra texto en la pantalla, de igual manera que en las conversaciones, pero a diferencia
de ellas, el texto no est&aacute; asociado a ning&uacute;n personaje ni al protagonista. 
</span></p>

<p class=MsoNormal><span lang=ES-TRAD>Crear un efecto mostrar texto:</span></p>

<UL type=disk>

<LI><p class=MsoNormal ><span lang=ES-TRAD ><b>Selecionar el efecto: </b>seleccionar el efecto en el panel de creaci&oacute;n de efectos.
Pulsar el bot&oacute;n OK.</span></p><br>

<LI><p class=MsoNormal ><span lang=ES-TRAD ><b>Panel de creaci&oacute;n del efecto: </b>a continuaci&oacute;n nos aparecer&aacute; el siguiente panel:<br><br>
<center><img src="Effects_ShowText_files/ShowText_effect_ES.jpg" alt="SHOWTEXT EFFECT.JPG fail!"/><br><br></center>
</span></p><br>
En primer lugar se permite editar el color principal y el del borde del texto a mostrar. Al usar cualquiera de los dos botones relacionados
con esta tarea, nos permite elegir la gama de colores, mostrando la previsualizaci&oacute;n de como quedar&aacute; en el texto "Esta es una l&iacute;nea de prueba".<br>
A continuaci&oacute;n se puede elegir una de las escenas existentes en el cap&iacute;tulo, para poder realizar una previsualizaci&oacute;n de como quedar&aacute; el texto en
la escena. Al igual que en otros efectos, la elecci&oacute;n de esta escena solo tiene fines de previsualizaci&oacute;n, y no significa que el efecto este 
relacionado con la escena. El texto introducido en este efecto se mostrar&aacute; en la escena en la que se ejecute.<br>
Mas abajo se encuentra un campo de texto el cual ser&aacute; rellenado con el texto que se dese&eacute; mostrar. <br>
Se puede elegir la posici&oacute;n del texto pinchando en la previsualizaci&oacute;n de la escena en el punto que deseado, o dando valores a las coordenadas
X e Y. En la posici&oacute;n elegida aparecer&aacute; el texto introcido con los colores elegidos.
</UL>



<p class=MsoNormal><span lang=ES-TRAD >&nbsp;</span></p>

</div>

</body>

</html>