<html>
<head></head>
<body lang=ES>

<img src="../logo-editor.png" alt="TEST IMAGE fail!"/>

<p><span lang=ES-TRAD><b><h1><center>Edici&oacute;n de la variables</center></h1></b><br><br>
&nbsp;&nbsp; El sistema de <A href="../flagsVars/flags.html" label="flags" title="flags">flags</A>
 nos permite a&ntilde;adir comportamiento narrativo a nuestros juegos.
No obstante, su uso se vuelve demasiado arduo en diversas situaciones. Por ejemplo, supongamos que 
queremos limitar el n&uacute;mero de veces que un jugador puede realizar una determinada acci&oacute;n (sea coger el pescado) a 3.
 Para poder recordar n&uacute;meros con los flags deber&iacute;amos tener un flag por cada valor posible (0, 1, 2 y 3 en este caso).<br> <br>
&nbsp;&nbsp;Por ello &lt e-Adventure &gt tambi&eacute;n incluye variables. De forma intuitiva podemos definir las variables como elementos 
que en todo momento tienen asociado un valor entero, que por defecto es 0, y cuyo valor podemos cambiar durante el transcurso de los juegos.
 Para a&ntilde;adir una condici&oacute;n en funci&oacute;n del valor de una variable s&oacute;lo tenemos que realizar un proceso an&aacute;logo al de los flags. 
 Ve&aacute;moslo con un ejemplo.<br><br>
 
&nbsp;&nbsp;Libro que creamos anteriormente. Para hacer eso creamos una variable, VecesLibroExaminado, que cuente cuantas veces se ha examinado el libro. 
Luego a la acci&oacute;n examinar del libro le a&ntilde;adimos la condici&oacute;n de que VecesLibroExaminado debe ser menor que tres. El proceso es el siguiente:<br><br>

Primero creamos la nueva acci&oacute;n examinar en el objeto libro. Para ello pulsamos en el nodo Acciones que cuelga del objeto Libro 
(no confundir con los libros en s&iacute;) con el bot&oacute;n derecho y luego pinchamos en ?A&ntilde;adir Acci&oacute;n Examinar?. Pulsamos en ?Editar condiciones? &lt
A&ntilde;adir condici&oacute;n. La diferencia est&aacute; en que ahora pulsamos en el bot&oacute;n de en medio, con el nombre ?Variables?. Rellenamos los campos de abajo
con los datos VecesLibroExaminado para el nombre de la variable, ?&lt? como funci&oacute;n de comparaci&oacute;n y 3 como valor.
<br><br>

<center><img src="Vars_Files/Vars.jpg" alt="VAR SELECTION.JPG fail!"/></center><br>


</span>
</body>

</html>